{
    "playerProfile": "A spunky, chubby teenager with gelled hair shot to fame after leading India to glory in the Under-19 Cricket at Kuala Lumpur in early 2008. In an Indian team filled with saint-like icons worthy of their own hagiographies, Virat Kohli, with his most un-Indian, 'bad-boy' intensity, would clearly be an outcast.  <br/><br/> <b>Grind through the ranks</b> <br/> He soon joined the senior Men in Blue in Sri Lanka, come August 2008. In the absence of the regular openers, Virat Kohli was given a chance to open the batting in the ODI series. He played some commendable knocks in his extended run as an opener, as India went on to win the ODI series. However, the established and formidable pair of Tendulkar and Sehwag kept Kohli out of the team  <br/><br/> The 20-year-old continued to impress for Delhi and dominated attacks, clearly demonstrating that he belonged at a much higher level; that junior cricket was beneath his standards. Kohli then traveled to Australia in 2009 for the Emerging players tournament and stamped his authority all over the bowling attacks. He added 'big-match temperament' to his résumé too, lacing a fluent hundred in the final against South Africa, and guiding his team to a clinical victory. The young prodigy, barely old enough to receive his man-of-the-match champagne, ended the tournament with 398 runs from 7 outings with two centuries and two fifties, ensuring that he remained fresh in the selectors' minds.  <br/><br/> <b>Cementing a national spot</b> <br/> The selectors had no choice but to give Kohli another go in the Indian side, and this time he strung together a number of impressive scores. After being given an extended run, he repaid their faith by notching up his maiden ODI hundred in an impressive run-chase against Sri Lanka in December 2009 - his first of many exemplary knocks in run-chases. In the Cricket final of 2011, the biggest stage of them all, Kohli, along with his Delhi teammate Gautam Gambhir, pulled off a largely underrated rescue effort with an 83-run stand after losing the openers early. This knock played a crucial role in setting the platform for MS Dhoni's fabled knock of 91*, which eventually won India the Cricket on that enchanting evening in Mumbai.  <br/><br/> In the hangover of the Cricket euphoria, Kohli continued to take giant strides in the limited-overs format. Three years after his ODI debut, he was finally handed the coveted Test cap in the Caribbean islands in July 2011, owing to the need to rest the senior players. After a series each against the Dukes ball and the SG ball, it was now time for his trial against the Kookaburra Down Under. In the first two Tests, he seemed to lack the technique to play in Australia, maintaining his low stance on the bouncy tracks. He also had a rather restricting trigger movement with his front-foot routinely coming across towards off-stump, thereby hindering the necessary movement to play back-foot shots such as the pull and the cut.  <br/><br/> <b>A baptism by fire Down Under</b> <br/> The selectors and the captain persisted with him going into the 3rd Test, and he delivered a break-through performance on a bouncy Perth wicket - an impressive 75 - where a visible change in technique was visible. He managed to stand tall, with a more open stance, and exhibited the back-foot shots in his repertoire during the course of the innings. The volatile Kohli managed to overshadow his impropriety in conduct with his performance in the final Test of the series. Notching up India's only century of a disastrous tour, Kohli was the shining light in amidst the chaos, as he stroked his way to a hundred in Adelaide exhibiting the will to improve and extraordinary focus under pressure in the searing heat and pressure of Australia. <br/><br/> While he grappled and clawed his way into the Test side, he went on a record-breaking spree in ODIs: the Indian record for the fastest to multiples-of-thousand runs in ODIs, culminating in the world record for the fastest to 9000 runs in ODIs. He was also the highest run-scorer for India in ODIs for three consecutive calendar years - 2010, 2011 and 2012 and won the ICC ODI cricketer of the year award in 2012.  <br/><br/> <b>That break-through innings…</b> <br/> We remember the accolades, but where did it all begin? There's always the one innings that made the world sit up and take notice; the 86-ball knock which he started off as a brash boy, but ended as a man. Chasing an improbable target of 321 off 40 overs to stay alive in the tournament, he laid into the Sri Lankan bowlers and carted his way to 133*, getting India home with more than 2 overs to spare, practically pulling them out of the airport after M.S. Dhoni rather ignorantly remarked that India had already been eliminated from the tournament.  <br/><br/> King Kohli had arrived. The king of the run-chase, and a plethora of ODI records in the modern age. <br/><br/> <b>Batting technique and idiosyncrasies</b> <br/> Kohli has a seemingly hot head on his shoulders, but he channels all his anger while he is batting. Known to be an aggressive batsman always on the lookout for runs, he has a fairly sound , albeit slightly unconventional technique, which makes him judge the length of the ball earlier than most, and amazingly quick wrists to run his hands through the ball, even against fast bowlers. He is equally adept against pace and spin, and never looks ungainly at the crease. With nimble foot-movement against the spinners, he is known to be quite destructive when the situation demands it. He has had to fill some rather big shoes of his predecessors, and has done an admirable job to say the least.  <br/><br/> <b>Technical Shortcomings </b> <br/> However, his slightly unconventional bottom-hand technique results in some technical shortcomings and lack of versatility. Kohli has dealt with swing bowling well, which is late and difficult to pick, but still less abrupt than seam bowling, which is almost unnatural and catches you off-guard. He is, without a doubt, one of the most gifted cricketers who has also worked very hard on his game and fitness. As a result, he picks the length early and has a swift and decisive backward or forward movement. However, he picks up the line early too, and as a result, reacts to it equally early. This is quite amazing in itself; however, on pitches lacking true bounce and aiding seam movement, it brings about his downfall. Virat tends to 'run his hands through the ball' beside him rather than punching it late under his line of vision (a virtue that his compatriot Ajinkya Rahane excels at).  <br/><br/> <b>Overseas Test Antics</b> <br/> He proved his credentials as a Test batsman on the tour of South Africa when he scored a sensational first innings hundred in Johannesburg in the first Test to bail India out of trouble and backed it up with a 96 in the second innings. Although Kohli wasn't exposed to the new ball, with Cheteshwar Pujara and Murali Vijay bunting the shine off it, it was an excellent innings against a formidable bowling line-up. He continued his good form in New Zealand as well and ended the tour on a high with an unbeaten century.  <br/><br/> However, against the raised seam of the Dukes ball and the skillful bowling of Anderson, Kohli's technical shortcomings were exposed when India toured England in 2014 for a grueling 5-Test series. He scored just 134 runs in ten innings, edging the ball to the slips by reaching out for it, and showing poor awareness of his off-stump; rather surprising for a batsman of his calibre. It was worrying that India's star batsman had failed them in trying conditions.  <br/><br/> He continues his struggles when exposed to the new ball and on 'sticky wickets'. His quiet series against South Africa in late 2015 was full of rank-turners; his injury-marred series against Australia in early 2017 had several wickets that were not conducive to batting; and the England series in 2014, of course. Barring that, the glaring dips in his batting, or 'aberrations', such as Brisbane 2014, Gros Islet 2016, and Pune 2017, have all come in difficult batting conditions, and he has been dismissed – believe it or not – by a chink in his batting technique.  <br/><br/> <b>Captaincy and a change in technique</b> <br/> With regular captain MS Dhoni ailing from an injury, Kohli was named stand-in captain for the first Test at Adelaide. After an abysmal tour of England, critics were sceptical of Kohli's performance in Australia in the Border-Gavaskar trophy in December. Kohli proved that they couldn't have been more wrong, as he scored two fluent hundreds in the first Test at Adelaide. His second innings masterclass of 141 almost pulled off a stunning run-chase on a notorious 5th day rank-turner, and went on to score a total of four hundreds on this tour. Saying that he had silenced critics would be an understatement; however, his technique of playing beside the ball, and the bat coming down from gully rather than slip continued to bother him whenever exposed to late lateral movement. <br/><br/> As India prepared for their title defence ahead of the 2015 Cricket Down Under, with the catch phrase 'Won't give it back' doing the rounds, Virat Kohli was touted to be a key performer for India. The Indians had a terrible run in Australia, having failed to win a single match in the Test series as well as the succeeding ODI tri-series. Kohli started off in signature fashion, with a typically stroke-filled hundred against Pakistan as India maintained their unbeaten run against their arch-rivals in ICC events. As India stormed into the semi-finals unbeaten, Kohli's form continued to take an uncharacteristic dip, culminating in a painstaking 1 in the semi-final loss against the co-hosts and eventual champions, Australia.  <br/><br/> Kohli, now the full-time Test captain, toured Sri Lanka with a young side without the services of Mahendra Singh Dhoni, wary of the Sri Lankan spinners' fabled 4th innings con-job. After losing the first Test, Kohli's India recorded a dramatic come-from-behind win in the series, going on to win 2-1. Kohli continued to build on his auspicious start to Test captaincy as he led them to a rout of the South Africans on a series of rank-turners all around India. He had a quiet series with the bat, as the more stoic batsmen of his team took over. Nonetheless, the triumph took India to the No. 1 spot in the ICC Test rankings for the first time since they forfeited it to England after the forgettable white-wash in 2011.  <br/><br/> <b>IPL and T20 dominance</b> <br/> He continued his emphatic run in the World T20, batting (and running) like a man possessed, thrashing boundaries with ridiculous ease. Despite an 89* in the semi-final against the West Indies (extending his inhuman run of form in the format), India's bowling panicked at a crucial stage. One had to feel sorry for him as he had to make do with the 'Player of the tournament' award for the second successive Twenty20 Cricket; a distinction he would've gladly exchanged for the elusive World T20 trophy. Kohli's thirst for runs showed no signs of slowing down as he looted a small matter of 973 runs during the 2016 edition of the Indian Premier League, the most (by far) by any batsman in the history of the tournament - as he led his Royal Challengers Bangalore (RCB) franchise to a runners-up finish.  <br/><br/> <b>What the future holds...</b> <br/> India's tour to South Africa in early 2018, their first major away Test assignment since Australia 2014 (before the 2015 Cricket), offers a new challenge: given a green track, is Virat really as good against the new ball? Is he good enough to play it out in case there are a few quick wickets? He has been protected from the new ball by a stoic Vijay and a solid Pujara until now. However, to make the ascent from 'good' to 'great', Virat Kohli has to prove to the world that he doesn't need to be protected against the new ball; that he is a versatile batsman capable of the grind against the moving ball.  <br/><br/> However, it isn't beyond Kohli to prove his critics wrong yet again, as he continues to take criticism on his stride, setting new standards for modern batsmanship. He already possesses an insatiable appetite for runs; and if he can correct this small chink in his armour and adjust his technique to play late and more compact shots in front of him, rather than beside him, then no force could stop him from becoming the perfect batsman. And as a captain, ruthless as he has been at home, if he can hand India the elusive Test series wins in Australia and South Africa, 'unprecedented' won't even begin to describe the extent of his achievements as a leader.  <br/><br/> <b>The final frontier</b> <br/> In the first week of 2018, Kohli went on to lead India in South Africa, a few weeks after he tied the knot with Indian actress and long-time girlfriend, Anushka Sharma. India went on to concede the series in the first two Tests, but came back to win the third Test match on a difficult wicket. In a series full of difficult wickets, Kohli exhibited tighter technique than he had in England, and batted better than he did in his more prolific tour of South Africa in 2013/14. Kohli went on to conquer his (personal) final frontier in England later in 2018 too, scoring 593 runs in 10 innings, including 2 hundreds, and not conceding his wicket to his fabled nemesis, Anderson, even once. India went on to lose the series 1-4, and Kohli's record as captain was tainted by two consecutive Test series losses away.  <br/><br/> Nevertheless, on a personal level, he had left no stone unturned to transform himself into the most consistent and versatile batsman of his age, and arguably the better of the Big Four. In October 2018, during the second of 3 consecutive hundreds against the West Indies in ODIs, he went on to become the fastest batsmen to reach the 10,000-run mark in ODIs, trouncing Sachin Tendulkar by a staggering 54 innings. Despite arguments about the two new balls, better bats, batting-friendly conditions, and more lethal bowlers, it was difficult to deny that this was a statistical outlier, very much along the lines of 99.94 - perhaps unlikely to ever be trounced.   <br/><br/> However, being a cricket romantic (as we all are), as we reflect on his prolific international career (and with a plethora of records to be broken over the next decade) one must look back at the CB series knock that changed it all. On that fateful night at Hobart, Kohli had not only kept his team in contention, he had actually dragged a drained Indian side out of the airport. That night, at the Bellerive Oval, Virat Kohli transcended into a league of his own to etch his name in history - and a cricketing superstar was born. <br/><br/> <b>IPL through the years</b> <br/><br/> Ahead of the 2019 edition of the Indian Premier League (IPL), Virat Kohli showed how much faith he had in the franchise by declaring that he would perhaps end his career with the Bangalore-based Royal Challengers. The only player to be a part of a single franchise for the entire duration of the tournament (right from the start of the cash-rich league in 2008), Kohli has developed an affection with the franchise and with the fans over the period of time.  <br/><br/> Having been brought into the franchise as a young emerging player in 2008, Kohli's growth has been stupendous. He learnt under the wings of Rahul Dravid and Anil Kumble, before finally establishing himself under Daniel Vettori. It wasn't a free-flowing start, in a team that was struggling to find the essence of the tournament, it wasn't a surprise that they had a struggling youngster in the midst. Having learnt the ropes in the first three-year cycle, it wasn't a surprise that he was the only player retained in 2011. The purple patch began somewhere around that region, he then proved it wasn't just a purple patch, it was a career that was beginning to flourish. Soon after, Kohli became the best in all aspects, not just white-ball cricket, but in the red-ball version as well. <br/><br/> It became a no-brainer when he was asked to captain the Bangalore franchise on a permanent basis from 2012 and it also translated into more consistency with the bat. Kohli soon turned into a fan favourite even as runs flowed from his bat. Circa, 2016 - the India and RCB captain blasted 973 runs - the most by any player in the history of the game and it included four hundreds - the most by a batsman in a single edition. Alas, all this didn't translate into a title triumph - one that has kept Kohli and Bangalore waiting <br/><br/> <b>Cricket through the years</b> <br/> Arguably one of the finest ODI batsmen of all-time, and certainly the greatest of his generation, Virat Kohli has played two senior Crickets after leading the junior team to the title in 2008. In 2011, on his Cricket debut, Kohli played second fiddle to Virender Sehwag on his way to a fluent hundred against Bangladesh. After a great innings to start with, Kohli had a quiet Cricket before scoring an important 35 in the final to rescue the chase with Gambhir and lay the foundation for a second Cricket triumph. In the 2015 edition, Kohli was fully primed as India's best limited-overs batsman with several solid performances under his belt and started off in fine fashion with a stable hundred against Pakistan. After a 46 against South Africa, his form took a dip during the latter stages of the Cricket before culminating in a 13-ball 1 as India crashed out of the Cricket in the semi-final. His ODI average in the 2017/18 ODI season has been a Bradmanesque 97.5, and he has amassed an unreal 19 hundreds since the 2015 Cricket. After the low of the Cricket ouster in 2015, Kohli leads the Indian side this time, with perhaps the strongest ODI team in the world, and as this generation's greatest ODI batsman. <br/><br/> Written by <b>Rishi Roy</b>",
    "odiStats": {
        "id": 1413,
        "Matches": 239,
        "Innings": 230,
        "Notouts": 39,
        "Runs": 11520,
        "HighestScore": 183,
        "BallsTaken": 12359,
        "Fours": 1085,
        "Sixes": 120,
        "Hundreds": 43,
        "DoubleHundreds": 0,
        "TripleHundreds": 0,
        "QuadrupleHundreds": 0,
        "Fifties": 54,
        "Ducks": 12,
        "BowlInnings": 48,
        "BallsBowled": 641,
        "Maidens": 1,
        "RunsGiven": 665,
        "WicketsTaken": 4,
        "BBIwickets": 1,
        "BBIruns": 15,
        "BBMwickets": 1,
        "BBMruns": 15,
        "FourWicket": 0,
        "FiveWicket": 0,
        "TenWicket": 0,
        "KeepingCatches": 0,
        "Stumpings": 0,
        "KeepingDismissals": 0,
        "BatAverage": 60.31,
        "BatStrikeRate": 93.21,
        "BowlAverage": 166.25,
        "Economy": 6.22,
        "BowlStrikeRate": 160.25
    },
    "playerInfo": {
        "id": "1413",
        "team": "India",
        "teamId": "2",
        "fullName": "Virat Kohli",
        "nickName": "Kohli",
        "shortName": "Kohli",
        "completeName": "Virat Kohli",
        "intro": "",
        "is_woman": false,
        "DoB": "1988-11-05",
        "DoBFormat": "November 05, 1988",
        "birth_year": "",
        "death_year": "",
        "date_of_death": "",
        "birthPlace": "Delhi",
        "playerrole_id": "",
        "player_role": "Batsman",
        "imageName": "img_20170109_084244.jpg",
        "imageWidth": "160",
        "imageHeight": "240",
        "coverImageName": "img_20170111_145801.jpg",
        "known_as": "",
        "place_of_death": "",
        "height": "5 ft 9 in (175 cm) ",
        "education": "",
        "fielding_position_id": "0",
        "other": "",
        "playerBatStyle": "Right Handed Bat",
        "playerBowlStyle": "Right-arm medium",
        "face_image_id": 170661
    },
    "testStats": {
        "id": 1413,
        "Matches": 78,
        "Innings": 133,
        "Notouts": 8,
        "Runs": 6673,
        "HighestScore": 243,
        "BallsTaken": 11674,
        "Fours": 735,
        "Sixes": 19,
        "Hundreds": 25,
        "DoubleHundreds": 6,
        "TripleHundreds": 0,
        "QuadrupleHundreds": 0,
        "Fifties": 21,
        "Ducks": 8,
        "BowlInnings": 9,
        "BallsBowled": 163,
        "Maidens": 2,
        "RunsGiven": 76,
        "WicketsTaken": 0,
        "BBIwickets": 0,
        "BBIruns": 0,
        "BBMwickets": 0,
        "BBMruns": 0,
        "FourWicket": 0,
        "FiveWicket": 0,
        "TenWicket": 0,
        "KeepingCatches": 0,
        "Stumpings": 0,
        "KeepingDismissals": 0,
        "BatAverage": 53.38,
        "BatStrikeRate": 57.16,
        "BowlAverage": 0,
        "Economy": 2.8,
        "BowlStrikeRate": 0
    },
    "iplStats": {
        "id": 1413,
        "Matches": 177,
        "Innings": 169,
        "Notouts": 26,
        "Runs": 5412,
        "HighestScore": 113,
        "BallsTaken": 4112,
        "Fours": 480,
        "Sixes": 190,
        "Hundreds": 5,
        "DoubleHundreds": 0,
        "TripleHundreds": 0,
        "QuadrupleHundreds": 0,
        "Fifties": 36,
        "Ducks": 6,
        "BowlInnings": 26,
        "BallsBowled": 251,
        "Maidens": 0,
        "RunsGiven": 368,
        "WicketsTaken": 4,
        "BBIwickets": 2,
        "BBIruns": 25,
        "BBMwickets": 2,
        "BBMruns": 25,
        "FourWicket": 0,
        "FiveWicket": 0,
        "TenWicket": 0,
        "KeepingCatches": 0,
        "Stumpings": 0,
        "KeepingDismissals": 0,
        "BatAverage": 37.85,
        "BatStrikeRate": 131.61,
        "BowlAverage": 92,
        "Economy": 8.8,
        "BowlStrikeRate": 62.75
    },
    "playerCareer": {
        "testDebut": "2011-06-20",
        "testDebutAgainst": "West Indies",
        "testDebutAgainstId": "10",
        "testDebutAt": "Sabina Park",
        "testDebutAtId": "57",
        "test_debut_match_id": "9853",
        "lastTestPlayed": "2019-08-22",
        "lastTestPlayedAt": "Sir Vivian Richards Stadium",
        "lastTestPlayedAtId": "109",
        "lastTestPlayedAgainst": "West Indies",
        "lastTestPlayedAgainstId": "10",
        "testMatchId": "22859",
        "odiDebut": "2008-08-18",
        "odiDebutAgainst": "Sri Lanka",
        "odiDebutAgainstId": "5",
        "odiDebutAtId": "13",
        "odiDebutAt": "Rangiri Dambulla International Stadium",
        "odi_debut_match_id": "3577",
        "lastOdiPlayed": "2019-08-14",
        "lastOdiPlayedAt": "Queen's Park Oval",
        "lastOdiPlayedAtId": "54",
        "lastOdiPlayedAgainst": "West Indies",
        "lastOdiPlayedAgainstId": "10",
        "odiMatchId": "22858",
        "t20iDebut": "2010-06-12",
        "t20iDebutAgainst": "Zimbabwe",
        "t20iDebutAgainstId": "12",
        "t20iDebutAt": "Harare Sports Club",
        "t20iDebutAtId": "69",
        "t20i_debut_match_id": "2300",
        "lastT20iPlayed": "2019-08-06",
        "lastT20iPlayedAt": "Providence Stadium",
        "lastT20iPlayedAtId": "110",
        "lastT20iPlayedAgainst": "West Indies",
        "lastT20iPlayedAgainstId": "10",
        "t20iMatchId": "22855",
        "iplDebut": "2008-04-18",
        "iplDebutAgainst": "Kolkata Knight Riders",
        "iplDebutAgainstId": "63",
        "iplDebutAt": "M.Chinnaswamy Stadium",
        "iplDebutAtId": "27",
        "ipl_debut_match_id": "10557",
        "lastIplPlayed": "2019-05-04",
        "lastIplPlayedAt": "M.Chinnaswamy Stadium",
        "lastIplPlayedAtId": "27",
        "lastIplPlayedAgainst": "Sunrisers Hyderabad",
        "lastIplPlayedAgainstId": "255",
        "iplMatchId": "22489",
        "clDebut": "2009-10-08",
        "clDebutAgainst": "Cape Cobras",
        "clDebutAgainstId": "101",
        "clDebutAt": "M.Chinnaswamy Stadium",
        "clDebutAtId": "27",
        "cl_debut_match_id": "11018",
        "lastClPlayed": "2011-10-09",
        "lastClPlayedAt": "MA Chidambaram Stadium",
        "lastClPlayedAtId": "11",
        "lastClPlayedAgainst": "Mumbai Indians",
        "lastClPlayedAgainstId": "62",
        "clMatchId": "10784",
        "intlDebutOn": "2008-08-18",
        "intlDebutAgainst": "Sri Lanka",
        "intlDebutAgainstId": "5",
        "intlDebutAt": "Rangiri Dambulla International Stadium",
        "intlDebutAtId": "13",
        "intlDebutMatchId": "3577",
        "intlDebutMatchTypeId": "2",
        "intlLastPlayedOn": "2019-08-22",
        "intlLastAgainst": "West Indies",
        "intlLastAgainstId": "10",
        "intlLastAt": "Sir Vivian Richards Stadium",
        "intlLastAtId": "109",
        "intlLastMatchId": "22859",
        "intlLastMatchTypeId": "1"
    },
    "t20iStats": {
        "id": 1413,
        "Matches": 70,
        "Innings": 65,
        "Notouts": 17,
        "Runs": 2369,
        "HighestScore": 90,
        "BallsTaken": 1744,
        "Fours": 231,
        "Sixes": 55,
        "Hundreds": 0,
        "DoubleHundreds": 0,
        "TripleHundreds": 0,
        "QuadrupleHundreds": 0,
        "Fifties": 21,
        "Ducks": 2,
        "BowlInnings": 12,
        "BallsBowled": 146,
        "Maidens": 0,
        "RunsGiven": 198,
        "WicketsTaken": 4,
        "BBIwickets": 1,
        "BBIruns": 13,
        "BBMwickets": 1,
        "BBMruns": 13,
        "FourWicket": 0,
        "FiveWicket": 0,
        "TenWicket": 0,
        "KeepingCatches": 0,
        "Stumpings": 0,
        "KeepingDismissals": 0,
        "BatAverage": 49.35,
        "BatStrikeRate": 135.84,
        "BowlAverage": 49.5,
        "Economy": 8.14,
        "BowlStrikeRate": 36.5
    }
}
